import 'package:flutter/material.dart';
import 'package:flutter_temple_app/src/model/data.dart';
import 'package:flutter_temple_app/src/themes/light_color.dart';
import 'package:flutter_temple_app/src/themes/theme.dart';
import 'package:flutter_temple_app/src/widgets/extentions.dart';
import 'package:flutter_temple_app/src/widgets/prayer_card.dart';
import 'package:flutter_temple_app/src/widgets/title_text.dart';

class PrayerPage extends StatefulWidget {
  PrayerPage({Key? key}) : super(key: key);

  @override
  PrayerPageState createState() => PrayerPageState();
}

class PrayerPageState extends State<PrayerPage> with TickerProviderStateMixin {
  @override
  void initState() {
    super.initState();
  }

  @override
  void dispose() {
    super.dispose();
  }

  bool isLiked = true;
  Widget _appBar() {
    return Container(
      padding: AppTheme.padding,
      color: Colors.orange,
      // Sets background to orange
      child: Row(
        mainAxisAlignment: MainAxisAlignment.spaceBetween,
        children: <Widget>[
          _icon(
            Icons.arrow_back_ios,
            color: Colors.black54,
            size: 15,
            padding: 12,
            isOutLine: true,
            onPressed: () {
              Navigator.of(context).pop();
            },
          ),
        ],
      ),
    );
  }

  Widget _icon(
    IconData icon, {
    Color color = LightColor.iconColor,
    double size = 20,
    double padding = 10,
    bool isOutLine = false,
    required Function onPressed,
  }) {
    return Container(
      height: 40,
      width: 40,
      padding: EdgeInsets.all(padding),
      // margin: EdgeInsets.all(padding),
      decoration: BoxDecoration(
        border: Border.all(
            color: LightColor.iconColor,
            style: isOutLine ? BorderStyle.solid : BorderStyle.none),
        borderRadius: BorderRadius.all(Radius.circular(13)),
        color: isOutLine
            ? Colors.transparent
            : Theme.of(context).colorScheme.background,
      ),
      child: Icon(icon, color: color, size: size),
    ).ripple(() {
      if (onPressed != null) {
        onPressed();
      }
    }, borderRadius: BorderRadius.all(Radius.circular(13)));
  }



  Widget _getPrayerWidget(String prayerType) {
    switch (prayerType) {
      case '1':
        return _mangalAchranWidget();
      case '2':
        return _mangalAchranLongWidget();
      case '3':
        return mangalArtiWidget();
      case '4':
        return narsinghArtiWidget();
     case '5':
        return tulsiArtiWidget();
     case '6':
        return guruVandanaWidget();
     case '7':
        return chaitanyaAstakWidget();
     case '8':
        return radhamadhavWidget();
     case '9':
        return gaurArtiWidget();
     case '10':
        return brahmasahintaWidget();
     case '11':
        return damodarAstakWidget();
 case '12':
        return prasadSevaWidget();

      default:
        return _mangalAchranWidget();
    }}

  @override
  Widget build(BuildContext context) {
    final String prayerId =
        ModalRoute.of(context)?.settings.arguments as String;

    return Scaffold(
      body: SafeArea(
        child:Container(
          decoration: BoxDecoration(
              gradient: LinearGradient(
            colors: [
              Color(0xfffbfbfb),
              Color(0xfff7f7f7),
            ],
            begin: Alignment.topCenter,
            end: Alignment.bottomCenter,
          )),
          child: _getPrayerWidget(prayerId)

          ,
      ),
      ),
    );
  }
  Widget _mangalAchranLongWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'मंगलाचरण - विस्तृत',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
            child: Text(
          '\n'
          'श्रीगुरु प्रणाम:-\n'
          'ॐ अज्ञान तिमिरान्धस्य ज्ञानाञ्जन शलाकया\n'
          'चक्षुरुन्मीलितं येन तस्मै श्रीगुरवे नमः\n\n'
          'श्रीरुप प्रणाम:-\n'
          'श्री चैतन्यमनोऽभीष्टं स्थापितं येन भूतले\n'
          'स्वयं रूपः कदा मह्यं ददाति स्वपदान्तिकम्\n\n'
          'मंगलाचरण:-\n'
          'वन्देऽहं श्रीगुरोः श्रीयुतपद – कमलं श्रीगुरुन् वैष्णवांश्च\n'
          'श्रीरूपं साग्रजातं सहगण – रघुनाथान्वितं तं सजीवम्\n'
          'साद्वैतं सावधूतं परिजन सहितं कृष्ण – चैतन्य – देवम्\n'
          'श्रीराधा – कृष्ण – पादान् सहगण – ललिता – श्रीविशाखान्वितांश्च\n\n'
          'श्रील प्रभुपाद प्रणति:-\n'
          'नम ॐ विष्णु – पादाय कृष्ण – प्रेष्ठाय भूतले\n'
          'श्रीमते भक्तिवेदान्त – स्वामिन् इति नामिने\n'
          'नमस्ते सारस्वते देवे गौर – वाणी प्रचारिणे\n'
          'निर्विशेष – शून्यवादी – पाश्चात्त्य – देश – तारिणे\n\n'
          'श्रील भक्तिसिद्धान्त सरस्वती प्रणति:-\n'
          'नमः ॐ विष्णुपादाय कृष्ण – प्रेष्ठाय भूतले\n'
          'श्रीमते भक्तिसिद्धान्त – सरस्वतीति – नामिने\n'
          'श्रीवार्षभानवी – देवी – दयिताय कृपाब्धये\n'
          'कृष्ण – सम्बन्ध – विज्ञान – दायिने प्रभवे नमः\n'
          'माधुर्य्योज्जवल – प्रेमाढय – श्रीरूपानुग – भक्तिद\n'
          'श्रीगौर – करुणा – शक्ति – विग्रहाय नमोऽस्तु ते\n'
          'नमस्ते गौर – वाणी – श्रीमूर्तये – दीन – तारिणे\n'
          'रूपानुग – विरुद्धाऽपसिद्धान्त – ध्वान्त – हारिणे\n\n'
          'श्रील गौरकिशोर प्रणति:-\n'
          'नमो गौरकिशोराय साक्षाद्वैराग्य मूर्त्तये\n'
          'विप्रलम्भ – रसाम्भोधे पादाम्बुजाय ते नमः\n\n'
          'श्रील भक्तिविनोद प्रणति:-\n'
          'नमो भक्ति – विनोदाय सच्चिदानन्द – नामिने\n'
          'गौर – शक्ति – स्वरूपाय रूपानुग – वराय ते\n\n'
          'श्रील जगन्नाथ प्रणति:-\n'
          'गौराविर्भाव – भूमेस्त्वं निर्देष्टा सज्जन – प्रियः\n'
          'वैष्णव – सार्वभौमः श्रीजगन्नाथाय ते नमः\n\n'
          'श्री वैष्णव प्रणाम:-\n'
          'वाञ्छा – कल्पतरुभ्यश्च कृपा – सिन्धुभ्य एव च\n'
          'पतितानां पावनेभ्यो वैष्णवेभ्यो नमो नमः\n\n'
          'श्री गौराङ्ग प्रणाम:-\n'
          'नमो महावदान्याय कृष्ण – प्रेम – प्रदाय ते\n'
          'कृष्णाय कृष्ण – चैतन्य – नाम्ने गौरत्विषे नमः\n\n'
          'श्री पञ्चतत्त्व प्रणाम:-\n'
          'पञ्चतत्त्वात्मकं कृष्णं भक्तरूपस्वरूपकम्\n'
          'भक्तावतारं भक्ताख्यं नमामि भक्तशक्तिकम्\n\n'
          'श्री कृष्ण प्रणाम:-\n'
          'हे कृष्ण करुणासिन्धो\n'
          'दीनबन्धो जगत्पते\n'
          'गोपेश गोपिकाकान्त\n'
          'राधाकान्त नमोऽस्तुते\n\n'
          'सम्बन्धाधिदेव प्रणाम:-\n'
          'जयतां सुरतौ पङ्गोर्मम मन्द मतेर्गती\n'
          'मत्सर्वस्व पदाम्भोजौ राधा – मदनमोहनौ\n\n'
          'अभिधेयाधिदेव प्रणाम:-\n'
          'दीव्यद् – वृन्दारण्य – कल्पद्रुमाधः\n'
          'श्रीमद् रत्नागार सिंहासनस्थौ\n'
          'श्रीमद् राधा श्रीलगोविन्द – देवौ\n'
          'प्रेष्ठालीभिः सेव्यमानौ स्मरामि\n\n'
          'प्रयोजनाधिदेव प्रणाम:-\n'
          'श्रीमान् रासरसारंभी वंशीवट – तटस्थितः\n'
          'कर्षन् वेणुस्वनैर्गोपीर्गोपीनाथः श्रियेऽस्तु नः\n\n'
          'श्री राधा प्रणाम:-\n'
          'तप्तकाञ्चनगौराङ्गि राधे वृन्दावनेश्वरि\n'
          'वृषभानुसुते देवी प्रणमामि हरिप्रिये\n\n'
          'पञ्चतत्त्व मंत्र:-\n'
          '(जय) श्रीकृष्ण चैतन्य प्रभू नित्यानंद\n'
          'श्रीअद्वैत गदाधर श्रीवासादि – गौरभक्तवृन्द\n\n'
            'हरे कृष्ण महामंत्र:-\n'
            'हरे कृष्ण हरे कृष्ण कृष्ण कृष्ण हरे हरे\n'
            'हरे राम हरे राम राम राम हरे हरे\n',


        style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
              textAlign: TextAlign.left,
            ),
          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget _mangalAchranWidget() {
     return SingleChildScrollView(
       padding: EdgeInsets.all(16.0),
       child: Column(
         children: <Widget>[
           _appBar(),
           TitleText(
             text: 'मंगलाचरण - संक्षिप्त',
             color: LightColor.orange,
             fontSize: 18,
             fontWeight: FontWeight.w800,
           ),
           Center(
             child: Text(
               '\n'
                   'श्रीगुरु प्रणाम:-\n'
                   'ॐ अज्ञान तिमिरान्धस्य ज्ञानाञ्जन शलाकया\n'
                   'चक्षुरुन्मीलितं येन तस्मै श्रीगुरवे नमः\n\n'
                   'श्रीरुप प्रणाम:-\n'
                   'श्री चैतन्यमनोऽभीष्टं स्थापितं येन भूतले\n'
                   'स्वयं रूपः कदा मह्यं ददाति स्वपदान्तिकम्\n\n'
                   'मंगलाचरण:-\n'
                   'वन्देऽहं श्रीगुरोः श्रीयुतपद – कमलं श्रीगुरुन् वैष्णवांश्च\n'
                   'श्रीरूपं साग्रजातं सहगण – रघुनाथान्वितं तं सजीवम्\n'
                   'साद्वैतं सावधूतं परिजन सहितं कृष्ण – चैतन्य – देवम्\n'
                   'श्रीराधा – कृष्ण – पादान् सहगण – ललिता – श्रीविशाखान्वितांश्च\n\n'
                   'श्रील प्रभुपाद प्रणति:-\n'
                   'नम ॐ विष्णु – पादाय कृष्ण – प्रेष्ठाय भूतले\n'
                   'श्रीमते भक्तिवेदान्त – स्वामिन् इति नामिने\n'
                   'नमस्ते सारस्वते देवे गौर – वाणी प्रचारिणे\n'
                   'निर्विशेष – शून्यवादी – पाश्चात्त्य – देश – तारिणे\n\n'
                   'श्री वैष्णव प्रणाम:-\n'
                   'वाञ्छा – कल्पतरुभ्यश्च कृपा – सिन्धुभ्य एव च\n'
                   'पतितानां पावनेभ्यो वैष्णवेभ्यो नमो नमः\n\n'
                   'श्री पञ्चतत्त्व प्रणाम:-\n'
                   'पञ्चतत्त्वात्मकं कृष्णं भक्तरूपस्वरूपकम्\n'
                   'भक्तावतारं भक्ताख्यं नमामि भक्तशक्तिकम्\n\n'
                   'श्री कृष्ण प्रणाम:-\n'
                   'हे कृष्ण करुणासिन्धो\n'
                   'दीनबन्धो जगत्पते\n'
                   'गोपेश गोपिकाकान्त\n'
                   'राधाकान्त नमोऽस्तुते\n\n'
                   'श्री राधा प्रणाम:-\n'
                   'तप्तकाञ्चनगौराङ्गि राधे वृन्दावनेश्वरि\n'
                   'वृषभानुसुते देवी प्रणमामि हरिप्रिये\n\n'
                   'पञ्चतत्त्व मंत्र:-\n'
                   '(जय) श्रीकृष्ण चैतन्य प्रभू नित्यानंद\n'
                   'श्रीअद्वैत गदाधर श्रीवासादि – गौरभक्तवृन्द\n\n'
                   'हरे कृष्ण महामंत्र:-\n'
                   'हरे कृष्ण हरे कृष्ण कृष्ण कृष्ण हरे हरे\n'
                   'हरे राम हरे राम राम राम हरे हरे\n',
               style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
               textAlign: TextAlign.left,
             ),
           ),

           Divider(
             thickness: 1,
             height: 40,
           ),
         ],
       ),
     );
  }

  Widget mangalArtiWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'मंगलारती',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    'संसार-दावानल-लीढ-लोका\n'
                    'त्राणाय कारुण्य-घनाघनत्वम् ||\n'
                    'प्राप्तस्य कल्याण-गुणार्णवस्य\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || १ ||\n\n'
                    'महाप्रभोः कीर्तन-नृत्य-गीत-\n'
                    'वादित्र-माद्यन-मनसो रसेन\n'
                    'रोमाञ्च-कम्पाश्रु-तरङ्ग-भाजो\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || २ ||\n\n'
                    'श्री-विग्रहाराधन-नित्य-नाना-\n'
                    'शृङ्गार-तन्-मन्दिर-मार्जनादौ\n'
                    'युक्तस्य भक्तांश् च नियुञ्जतोऽपि\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ३ ||\n\n'
                    'चतुर्-विध-श्री-भगवत्-प्रसाद-\n'
                    'स्वाद्व्-अन्न-तृप्तान् हरि-भक्त-सङ्घान्\n'
                    'कृत्वैव तृप्तिं भजतः सदैव\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ४ ||\n\n'
                    'श्री-राधिका-माधवयोर्-अपार-\n'
                    'माधुर्य-लीला गुण-रूप-नाम्नाम्\n'
                    'प्रति-क्षणास्वादन-लोलुपस्य\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ५ ||\n\n'
                    'निकुञ्ज-यूनो रति-केलि-सिद्ध्यै\n'
                    'या यालिभिर् युक्तिर् अपेक्षणीया\n'
                    'तत्राति-दाक्ष्याद् अति-वल्लभस्य\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ६ ||\n\n'
                    'साक्षाद् धरित्वेन समस्त-शास्त्रैर्\n'
                    'उक्तस् तथा भाव्यत एव सद्भिः\n'
                    'किन्तु प्रभोर् यः प्रिय एव तस्य\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ७ ||\n\n'
                    'यस्य प्रसादाद् भगवत्-प्रसादो\n'
                    'यस्याप्रसादान् न गतिः कुतोऽपि\n'
                    'ध्यायन् स्तुवंस् तस्य यशस् त्रि-सन्ध्यं\n'
                    '          वन्दे गुरोः श्री-चरणारविन्दम् || ८ ||\n',



              style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
              textAlign: TextAlign.left,
            ),
          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget narsinghArtiWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'नरसिम्ह आरती',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    'नमस्ते नरसिंहाय:-\n\n'
                    'नमस्ते नरसिंहाय\n'
                    'प्रह्लादाह्लाद-दायिने\n'
                    'हिरण्यकशिपोर्वक्षः-\n'
                    'शिला-टङ्क-नखालये\n\n'
                    'इतो नृसिंहः परतो नृसिंहो\n'
                    'यतो यतो यामि ततो नृसिंहः\n'
                    'बहिर्नृसिंहो हृदये नृसिंहो\n'
                    'नृसिंहमादिं शरणं प्रपद्ये\n\n'
                    'तव करकमलवरे नखमद्भुत-शृङ्गं\n'
                    'दलितहिरण्यकशिपुतनुभृङ्गम्\n'
                    'केशव धृतनरहरिरूप जय जगदीश हरे\n',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )

          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }

  Widget tulsiArtiWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री तुलसी आरती',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child:  Text(
              '\n'
              'श्री तुलसी प्रणाम:-\n\n'
              'वृन्दायै तुलसी देव्यायै\n'
              'प्रियायै केशवस्यच\n'
              'कृष्ण भक्ती प्रदे देवी\n'
              'सत्य वत्यै नमो नमः\n\n'
              'श्री तुलसी आरती:-\n\n'
              'तुलसी कृष्णा प्रेयसी नमो नमों\n'
              'राधा कृष्णा सेवा पाबो एई अभिलाषी\n'
                'ये तोमार शरण लोय, तारा वांछा पूर्ण होय\n'
                'कृपा करी कोरो तारे वृंदावन वासीं\n\n'
                'मोरा एई अभिलाष विलास कुंजे दिओ वास\n'
                'नयन हेरीबो सदा युगल रूप रासि\n'
              'एई निवेदन धर सखीर अनुगत कोरो\n'
              'सेवा अधिकार दिए कोरो निज दासी\n\n'
              'दिन कृष्णा दासे कोय एई येन मोरा होय\n'
              'श्री राधा गोविंद प्रेमे सदा येन भासिं\n\n'
              'श्री तुलसी प्रदक्षिणा:-\n\n'
              'यानि कानि च पापानी\n'
                'ब्रह्म हत्यदिकानी च\n'
                'तानि तानि प्रणश्यन्ति\n'
                'प्रदक्षिणः पदे पदे\n',

                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )

          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }

  Widget guruVandanaWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री गुरु वंदना',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    'श्री गुरु-चरण-पद्म:-\n\n'
                    'केवल भकति सद्म\n'
                    'बंदॊ मुयि सावधान मते\n'
                    'जाहार प्रसादे भाइ ए भव तोरिया जाइ\n'
                    'कृष्ण-प्राप्ति होय् जाहा ह’ते\n\n'
                    'गुरु-मुख-पद्म-वाक्य, चित्तेतॆ कॊरिया ऐक्य\n'
                    'आर् ना कोरिहो मने आशा\n\n'
                    'श्री गुरु-चरणे रति, ऎइ से उत्तम-गति,\n'
                    'जे प्रसादे पूरे सर्व आशा\n\n'
                    'चखु-दान् दिलो जेइ जन्मे जन्मे प्रभु सेइ\n'
                    'दिव्य-ज्ञान् हृदे प्रॊकाशितो\n\n'
                    'प्रेम-भक्ति जाहा होइते अविद्या विनाश जाते\n'
                    'वेदॆ गाय् जाहार चरितो\n\n'
                    'श्री गुरु करुणासिंधु, अधम जनर बंधु\n'
                    'लोकनाथ् लोकेर जीवन\n\n'
                    'प्रभुपाद पतित पावन....\n'
                    'हा हा प्रभु कोरो दोया, देहो मोरे पद-छाया,\n'
                    'एबे जश घुषुक् त्रिभुवन\n\n'
                    'जय जय प्रभुपाद!!\n',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )


          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget chaitanyaAstakWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री चैतन्य शिक्षाष्टक',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    'चेतोदर्पणमार्जनं भव-महादावाग्नि-निर्वापणम्\n'
                    'श्रेयःकैरवचन्द्रिकावितरणं विद्यावधू-जीवनम् ।\n'
                    'आनंदाम्बुधिवर्धनं प्रतिपदं पूर्णामृतास्वादनम्\n'
                    '          सर्वात्मस्नपनं परं विजयते श्रीकृष्ण-संकीर्तनम् || १ ||\n\n'
                    'नाम्नामकारि बहुधा निज सर्व शक्तिस्\n'
                    'तत्रार्पिता नियमितः स्मरणे न कालः।\n'
                    'एतादृशी तव कृपा भगवन्ममापि\n'
                    '          दुर्दैवमीदृशमिहाजनि नानुरागः || २ ||\n\n'
                    'तृणादपि सुनीचेन\n'
                    'तरोरपि सहिष्णुना ।\n'
                    'अमानिना मानदेन\n'
                    '          कीर्तनीयः सदा हरिः || ३ ||\n\n'
                    'न धनं न जनं न सुन्दरीं\n'
                    'कवितां वा जगदीश कामये।\n'
                    'मम जन्मनि जन्मनीश्वरे\n'
                    '          भवताद् भक्तिरहैतुकी त्वयि || ४ ||\n\n'
                    'अयि नन्दतनुज किंकरं\n'
                    'पतितं मां विषमे भवाम्बुधौ।\n'
                    'कृपया तव पादपंकज-\n'
                    '          स्थितधूलिसदृशं विचिन्तय || ५ ||\n\n'
                    'नयनं गलदश्रुधारया\n'
                    'वदनं गदगदरुद्धया गिरा ।\n'
                    'पुलकैर्निचितं वपुः कदा\n'
                    '          तव नाम-ग्रहणे भविष्यति || ६ ||\n\n'
                    'युगायितं निमेषेण\n'
                    'चक्षुषा प्रावृषायितम्।\n'
                    'शून्यायितं जगत् सर्वं\n'
                    '          गोविन्द विरहेण मे || ७ ||\n\n'
                    'आश्लिष्य वा पादरतां पिनष्टु माम्\n'
                    'अदर्शनान्-मर्महतां करोतु वा।\n'
                    'यथा तथा वा विदधातु लम्पटो\n'
                    '          मत्प्राणनाथस्-तु स एव नापरः || ८ ||\n',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )



          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget radhamadhavWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'जय राधा माधव, कुन्ज बिहारी',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    'जय राधा माधव, कुन्ज बिहारी ॥ धृ ॥\n\n'
                    'जय गोपी जन वल्लभ, गिरिवर धारी ॥\n'
                    'यशोदा नंदन, ब्रज जन रंजन ।\n'
                    'यमुना तीर, वन चारि ॥\n\n'
                    'जय राधा माधव, कुन्ज बिहारी ॥ धृ ॥\n',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )


          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget prasadSevaWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'प्रसाद-सेवा प्रार्थना',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          SizedBox(height: 20,),
          Center(
            child: Text(
              ''
                  'महाप्रसादे गोविन्दे,नामब्राह्मणि वैष्णवे।\n'
                  'स्वल्प-पुण्यवतां राजन्,विश्वासो नैव जायते॥\n\n'

                  'शरीर-अविद्या-जाल, जड़ेन्द्रिय-ताहे काल।\n'
                  'जीवे फले विषय-सागर, लाभ-सुधु दुर्लभ-संस्कार॥\n\n'

                  'कृष्ण-प्रसाद-पाए, सर्व-दुःख-नाश।\n'
                  'प्रसाद-सेवा-करे, हय भक्त-दास॥\n\n'

                  'नमो ब्रह्मण्य देवाय, गो-ब्राह्मण हिताय च।\n'
                  'जगद्-धिताय कृष्णाय, गोविन्दाय नमो नमः॥\n\n',

              style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
              textAlign: TextAlign.left,
            ),
          ),


          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget gaurArtiWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री गौर आरती',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
              child: Text(
                '\n'
                    '(किब) जय जय गोराचाँदेर आरतिक शोभा |\n'
                    '          जाह्नवी तट वने जगमन लोभा || १ ||\n\n'
                    'दक्षिणे निताईचाँद बामे गदाधर |\n'
                    '          निकटे अद्वैत श्रीवास छत्रधर || २ ||\n\n'
                    'बसियाछे गौराचाँदेर रत्न-सिंहासने |\n'
                    '          आरति करेन ब्रह्मा-आदि देवगणे || ३ ||\n\n'
                    'नरहरि आदि कोरि चामर ढुलाय |\n'
                    '          सञ्जय मुकुंद वासुघोष आदि गाय || ४ ||\n\n'
                    'शंख बाजे घण्टा बाजे, बाजे करताल |\n'
                    '          मधुर मृदंग बाजे परम रसाल || ५ ||\n\n'
                    'शंख बाजे घंटा बाजे, मधुर मधुर मधुर बाजे |\n'
                    '          निताई गौर हरिबोल हरिबोल हरिबोल हरिबोल || ६ ||\n\n'
                    'बहु कोटि चन्द्र जिनि वदन उज्जवल |\n'
                    '          गलदेशे वनमाला करे झलमल || ७ ||\n\n'
                    'शिव-शुक नारद प्रेमे गद्‌गद् |\n'
                    '          भकति-विनोद देखे गौरार सम्पद || ८ ||\n',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
                textAlign: TextAlign.left,
              )



          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
  Widget damodarAstakWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री दामोदर अष्टक',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
            child: Text(
              '\n'
                  'नमामीश्वरं सच्चिदानंदरूपं\n'
                  'लसत्कुण्डलं गोकुले भ्राजमानं ।\n'
                  'यशोदाभियोलूखलाद्धावमानं\n'
                  '          परामृष्टमत्यं ततो द्रुत्य गोप्या || १ ||\n\n'
                  'रुदन्तं मुहुर्नेत्रयुग्मं मृजन्तम्\n'
                  'कराम्भोज-युग्मेन सातङ्क-नेत्रम् ।\n'
                  'मुहुः श्वास-कम्प-त्रिरेखाङ्क-कण्ठ\n'
                  '          स्थित-ग्रैवं दामोदरं भक्ति-बद्धम् || २ ||\n\n'
                  'इतीदृक् स्वलीलाभिरानंद कुण्डे\n'
                  'स्व-घोषं निमज्जन्तम् आख्यापयन्तम् ।\n'
                  'तदीयेशितज्ञेषु भक्तिर्जितत्वम\n'
                  '          पुनः प्रेमतस्तं शतावृत्ति वन्दे || ३ ||\n\n'
                  'वरं देव! मोक्षं न मोक्षावधिं वा\n'
                  'न चान्यं वृणेऽहं वरेशादपीह ।\n'
                  'इदं ते वपुर्नाथ गोपाल बालं\n'
                  '          सदा मे मनस्याविरास्तां किमन्यैः || ४ ||\n\n'
                  'इदं ते मुखाम्भोजम् अत्यन्त-नीलैः\n'
                  'वृतं कुन्तलैः स्निग्ध-रक्तैश्च गोप्या।\n'
                  'मुहुश्चुम्बितं बिम्बरक्ताधरं मे\n'
                  '          मनस्याविरास्तामलं लक्षलाभैः || ५ ||\n\n'
                  'नमो देव दामोदरानन्त विष्णो\n'
                  'प्रसीद प्रभो दुःख-जालाब्धि-मग्नम् ।\n'
                  'कृपा-दृष्टि-वृष्ट्याति-दीनं बतानु\n'
                  '          गृहाणेष मामज्ञमेध्यक्षिदृश्यः || ६ ||\n\n'
                  'कुबेरात्मजौ बद्ध-मूर्त्यैव यद्वत्\n'
                  'त्वया मोचितौ भक्ति-भाजौ कृतौ च ।\n'
                  'तथा प्रेम-भक्तिं स्वकां मे प्रयच्छ\n'
                  '          न मोक्षे ग्रहो मेऽस्ति दामोदरेह || ७ ||\n\n'
                  'नमस्तेऽस्तु दाम्ने स्फुरद्-दीप्ति-धाम्ने\n'
                  'त्वदीयोदरायाथ विश्वस्य धाम्ने ।\n'
                  'नमो राधिकायै त्वदीय-प्रियायै\n'
                  '          नमोऽनन्त-लीलाय देवाय तुभ्यम् || ८ ||\n\n',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
              textAlign: TextAlign.left,

            ),




          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }

  Widget brahmasahintaWidget() {
    return SingleChildScrollView(
      padding: EdgeInsets.all(16.0),
      child: Column(
        children: <Widget>[
          _appBar(),
          TitleText(
            text: 'श्री ब्रह्मसंहिता - श्री ब्रह्मसंहिता -',
            color: LightColor.orange,
            fontSize: 18,
            fontWeight: FontWeight.w800,
          ),
          Center(
            child: Text(
              '\n'
                  'ईश्वरः परमः कृष्णः\n'
                  'सच्चिदानन्दविग्रहः ।\n'
                  'अनादिरादिर्गोविन्दः\n'
                  'सर्वकारणकारणम् || १ ||\n\n'
                  'चिन्तामणिप्रकरसद्मसु कल्पवृक्ष\n'
                  'लक्षावृतेषु सुरभीरभिपालयन्तम् ।\n'
                  'लक्ष्मीशहस्रशतसम्भ्रमसेव्यमानं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २ ||\n\n'
                  'वेणुं क्वणन्तमरविन्ददलायताक्षं\n'
                  'बर्हावतंसमसिताम्बुदसुन्दराङ्गम् ।\n'
                  'कन्दर्पकोटिकमनीयविशेषशोभं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ३ ||\n\n'
                  'आलोलचन्द्रकलसद्-वनमाल्यवंशी\n'
                  'रत्नांगदं प्रणयकेलिकलाविलासम् ।\n'
                  'श्यामं त्रिभंगललितं नियतप्रकाशं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ४ ||\n\n'
                  'अङ्गानियस्य सकलेन्द्रियवृत्तिमन्ति\n'
                  'पश्यन्ति पान्ति कलयन्ति चिरं जगन्ति ।\n'
                  'आनन्दचिन्मयसदुज्वलविग्रहस्य\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ५ ||\n\n'
                  'अद्वैतमच्युतमनादिमनन्तरूपं\n'
                  'आद्यं पुराणपुरुषं नवयौवनं च ।\n'
                  'वेदेषु दुर्लभमदुर्लभमात्मभक्तौ\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ६ ||\n\n'
                  'पन्थास्तु कोटिशतवत्सरसम्प्रगम्यो\n'
                  'वायोरथापि मनसो मुनिपुंगवानाम्।\n'
                  'सोऽप्यस्ति यत्प्रपदसीम्न्यविचिन्त्यतत्त्वे\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ७ ||\n\n'
                  'एकोऽप्यसौ रचयितुं जगदण्डकोटिं-\n'
                  'यच्छक्तिरस्ति जगदण्डचया यदन्तः ।\n'
                  'अण्डान्तरस्थपरमाणुचयान्तरस्थं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ८ ||\n\n'
                  'यद्भावभावितधियो मनुजास्तथैव\n'
                  'सम्प्राप्य रूपमहिमासनयानभूषाः ।\n'
                  'सूक्तैर्यमेव निगमप्रथितैः स्तुवन्ति\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ९ ||\n\n'
                  'आनन्दचिन्मयरसप्रतिभाविताभिस्\n'
                  'ताभिर्य एव निजरूपतया कलाभिः ।\n'
                  'गोलोक एव निवसत्यखिलात्मभूतो\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १० ||\n\n'
                  'प्रेमाञ्जनच्छुरितभक्तिविलोचनेन\n'
                  'सन्तः सदैव हृदयेषु विलोकयन्ति ।\n'
                  'यं श्यामसुन्दरमचिन्त्यगुणस्वरूपं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || ११ ||\n\n'
                  'रामादिमूर्तिषु कलानियमेन तिष्ठन्\n'
                  'नानावतारमकरोद् भुवनेषु किन्तु ।\n'
                  'कृष्णः स्वयं समभवत्परम: पुमान् यो\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १२ ||\n\n'
                  'यस्य प्रभा प्रभवतो जगदण्डकोटि-\n'
                  'कोटिष्वशेषवसुधादि विभूतिभिन्नम् ।\n'
                  'तद् ब्रह्म निष्कलमनंतमशेषभूतं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १३ ||\n\n'
                  'माया हि यस्य जगदण्डशतानि सूते\n'
                  'त्रैगुण्यतद्विषयवेदवितायमाना ।\n'
                  'सत्त्वावलम्बिपरसत्त्वं विशुद्धसत्त्वं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १४ ||\n\n'
                  'आनन्दचिन्मयरसात्मतया मन:सु\n'
                  'यः प्राणिनां प्रतिफलन् स्मरतामुपेत्य ।\n'
                  'लीलायितेन भुवनानि जयत्यजस्रं\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १५ ||\n\n'
                  'गोलोकनाम्नि निजधाम्नि तले च तस्य\n'
                  'देवीमहेशहरिधामसु तेषु तेषु ।\n'
                  'ते ते प्रभावनिचया विहिताश्च येन\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १६ ||\n\n'
                  'सृष्टिस्थितिप्रलयसाधनशक्तिरेका\n'
                  'छायेव यस्य भुवनानि विभर्ति दुर्गा ।\n'
                  'इच्छानुरूपमपि यस्य च चेष्टते सा\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १७ ||\n\n'
                  'क्षीरं यथा दधि विकारविशेषयोगात्\n'
                  'सञ्जायते न हि ततः पृथगस्ति हेतोः ।\n'
                  'यः शम्भुतामपि तथा समुपैति कार्याद्\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १८ ||\n\n'
                  'दीपार्चिरेव हि दशान्तरमभ्युपेत्य\n'
                  'दीपायते विवृतहेतुसमानधर्मा ।\n'
                  'यस्तादृगेव हि च विष्णुतया विभाति\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || १९ ||\n\n'
                  'यः कारणार्णवजले भजति स्म योग-\n'
                  'निद्रामनन्तजगदण्डसरोमकूपः ।\n'
                  'आधारशक्तिमवलम्ब्य परां स्वमूर्ति\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २० ||\n\n'
                  'यस्यैकनिश्वसितकालमथावलम्ब्य\n'
                  'जीवन्ति लोमविलजा जगदण्डनाथा: ।\n'
                  'विष्णुर्महान् स इह यस्य कलाविशेषो\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २१ ||\n\n'
                  'भास्वान् यथाश्मशकलेषु निजेषु तेज:\n'
                  'स्वीयं कियत्प्रकटयत्यपि तद्वदत्र ।\n'
                  'ब्रह्मा य एष जगदण्डविधानकर्ता\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २२ ||\n\n'
                  'यत्पादपल्लवयुगं विधानाय कुम्भ\n'
                  'द्वन्द्वे प्रणामसमये स गणाधिराजः ।\n'
                  'विघ्नान् विहन्तुमलमस्य जगत्रयस्य\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २३ ||\n\n'
                  'अग्निर्मही गगनमम्बु मरुद्दिशश्च\n'
                  'कालस्तथात्ममनसीति जगत्त्रयाणि ।\n'
                  'यस्माद् भवन्ति विभवन्ति विशन्ति यं च\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २४ ||\n\n'
                  'यच्चक्षुरेष सविता सकलग्रहाणां\n'
                  'राजा समस्तसुरमूर्तिरशेषतेजाः ।\n'
                  'यस्याज्ञया भ्रमति सम्भृतकालचक्रो\n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २५ ||\n\n'
                  'धर्मोऽथ पापनिचयः श्रुतयस्तपांसि\n'
                  'योगस्य व्याकुलिता निरवधि स्थिता ।\n'
                  'सर्वस्तं योगमालम्ब्य सदा च पाति \n'
                  'गोविन्दमादिपुरुषं तमहं भजामि || २६ ||\n\n'
                  'नमो नमो हृषीकेश गोविन्दपदांबुजे\n'
                  'सदा सदा प्रणमिष्यहमि ।\n\n',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.w400),
              textAlign: TextAlign.left,

            ),



          ),

          Divider(
            thickness: 1,
            height: 40,
          ),
        ],
      ),
    );
  }
}
